Repository: P1sec/httpcore
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: fr

source: Usage
fr: Utilisation

source: Contributing
fr: Contribuer

source: License
fr: Licence

source: Source Code
fr: Code source

source: Development
fr: Développement

source: The HTTP Core package provides a minimal low-level HTTP client, which does one thing only. Sending HTTP requests.
fr: HTTP Core est un client HTTP bas niveau minimaliste. Il ne fait qu'une seule chose : envoyer des requêtes HTTP.

source: It does not provide any high level model abstractions over the API, does not handle redirects, multipart uploads, building authentication headers, transparent HTTP caching, URL parsing, session cookie handling, content or charset decoding, handling JSON, environment based configuration defaults, or any of that Jazz.
fr: Pas de modeèles ou d'abstractions haut-niveau, pas de gestion des redirections, des _multipart uploads_, d'entêtes d'authentification, de mise en cache, d'analyse d'URL, de déchiffrage de contenu ou de _charset_, de JSON, de valeurs par défaut via des variables d'environnement, ou tout autre gadget de ce genre.

source: Some things HTTP Core does do:
fr: Par contre, voici ce que HTTP Core _peut_ faire :

source: Sending HTTP requests.
fr: Envoyer des requêtes HTTP.

source: Provides both sync and async interfaces.
fr: Gérer sync et async grâce à des interfaces dédiées.

source: Supports HTTP/1.1 and HTTP/2.
fr: Gérer HTTP/1.1 et HTTP/2.

source: Async backend support for `asyncio`, `trio` and `curio`.
fr: Fonctionner avec `asyncio`, `trio` et `curio`.

source: Automatic connection pooling.
fr: Mutualiser automatiquement les connexions (*connection pooling*).

source: HTTP(S) proxy support.
fr: Fonctionner avec un proxy HTTP(S).

source: For HTTP/1.1 only support, install with...
fr: Si HTTP/1.1 suffit, utilisez cette commande :

source: For HTTP/1.1 and HTTP/2 support, install with...
fr: Pour HTTP/1.1 et HTTP/2, utilisez cette commande :

source: Quickstart
fr: Démarrage rapide

source: Here's an example of making an HTTP GET request using `httpcore`...
fr: Dans cet exemple, on utilise `httpcore` pour envoyer une requête HTTP GET :

source: Or, using async...
fr: En async, voici à quoi cela ressemble :

source: You probably don't want to be using HTTP Core directly. It might make sense if you're writing something like a proxy service in Python, and you just want something at the lowest possible level, but more typically you'll want to use a higher level client library, such as `httpx`.
fr: Dans la pratique, il est probable que presque personne ne doive utiliser HTTP Core directement. À la limite si vous écrivez quelque chose comme un service de proxying en Python, et qu'il vous faut une interface aussi bas-niveau que possible. Mais en général, on vous recommande plutôt d'utiliser un client HTTP haut-niveau, comme `httpx`.

source: The motivation for `httpcore` is:
fr: `httpcore` répond à plusieurs objectifs:

source: To provide a reusable low-level client library, that other packages can then build on top of.
fr: Fournir une librarie client bas-niveau, utilisable comme base par d'autres libraries.

source: To provide a *really clear interface split* between the networking code and client logic, so that each is easier to understand and reason about in isolation.
fr: Séparer *très clairement* le code réseau de la logique client, afin qu'il soit plus facile de comprendre et de travailler avec l'un ou l'autre de façon isolée.
